Repository: K4DJee/isky_flutter
Catalog: lib/l10n/app_*.arb
Languages: es, fr, ru

# privacyPolicySection4Sync
source: - Synchronization: Data is transmitted securely (via HTTPS). The server does not store data after transfer.
es: - Sincronización: Los datos se transmiten de forma segura (usando HTTPS). El servidor no conserva los datos después de la transferencia.
fr: - Synchronisation : Les données sont transmises de manière sécurisée (via HTTPS). Le serveur ne conserve pas les données après transfert.
ru: - Синхронизация: Данные передаются в зашифрованном виде (используя HTTPS). Сервер не хранит данные после передачи.

# privacyPolicySection4Retention
source: - Data retention: We do not store your data on servers. Local data is deleted when the App is uninstalled or upon your request.
es: - Conservación de datos: No almacenamos sus datos en servidores. Los datos locales se eliminan al desinstalar la Aplicación o a petición suya.
fr: - Conservation des données : Nous ne stockons pas vos données sur nos serveurs. Les données locales sont supprimées lors de la désinstallation de l’Application ou sur votre demande.
ru: - Срок хранения: Мы не храним ваши данные на серверах. Локальные данные удаляются при деинсталляции Приложения или по вашему запросу.

# privacyPolicySection4Security
source: - Security measures: We apply standard protection measures such as encryption, firewalls, and regular audits to prevent unauthorized access. However, no system is completely secure, and we cannot guarantee absolute protection.
es: - Medidas de seguridad: Aplicamos medidas estándar como cifrado, cortafuegos y auditorías regulares para proteger contra el acceso no autorizado. Sin embargo, ningún sistema es completamente seguro y no podemos garantizar una protección absoluta.
fr: - Mesures de sécurité : Nous appliquons des mesures standards telles que le chiffrement, les pare-feu et des audits réguliers. Toutefois, aucun système n’est totalement sûr, et nous ne pouvons garantir une protection absolue.
ru: - Меры безопасности: Мы применяем стандартные меры, такие как шифрование, firewalls и регулярные аудиты, для защиты от несанкционированного доступа. Однако никакая система не является полностью безопасной, и мы не можем гарантировать абсолютную защиту.

# privacyPolicySection5Title
source: 5. Your Rights
es: 5. Sus derechos
fr: 5. Vos droits
ru: 5. Ваши права

# privacyPolicySection5RightsIntro
source: Depending on your location (for example, under GDPR in the EU or the Russian Federal Law on Personal Data), you have the right to:
es: Según su ubicación (por ejemplo, conforme al RGPD en la UE o a la Ley Federal Rusa sobre Datos Personales), usted tiene derecho a:
fr: Selon votre lieu de résidence (par exemple, conformément au RGPD dans l’UE ou à la loi fédérale russe sur les données personnelles), vous disposez des droits suivants :
ru: В зависимости от вашего местоположения (например, в соответствии с GDPR в ЕС или Федеральным законом РФ "О персональных данных"), вы имеете права:

# privacyPolicySection5Access
source: - Access your data.
es: - Acceder a sus datos.
fr: - Accéder à vos données.
ru: - Доступ к вашим данным.

# privacyPolicySection5Correction
source: - Correct or update your data.
es: - Corregir o actualizar sus datos.
fr: - Corriger ou mettre à jour vos données.
ru: - Исправление или обновление данных.

# privacyPolicySection5Deletion
source: - Delete your data (for example, via export and clearing within the App).
es: - Eliminar sus datos (por ejemplo, mediante exportación y limpieza dentro de la Aplicación).
fr: - Supprimer vos données (par exemple via l’exportation et la suppression dans l’Application).
ru: - Удаление данных (например, через экспорт и очистку в Приложении).

# privacyPolicySection5Complaint
source: - File a complaint with a supervisory authority.
es: - Presentar una queja ante una autoridad supervisora.
fr: - Déposer une plainte auprès d’une autorité de contrôle.
ru: - Жалоба в надзорный орган.

# privacyPolicySection7Title
source: 6. Changes to This Policy
es: 6. Cambios en esta política
fr: 6. Modifications de la politique
ru: 6. Изменения в политике

# privacyPolicySection7Changes
source: We may update this policy. Updates will be published in the App or on our website. Continuing to use the App after an update constitutes acceptance of the changes.
es: Podemos actualizar esta política. Los cambios se publicarán en la Aplicación o en nuestro sitio web. Al continuar utilizando la Aplicación después de una actualización, usted acepta los cambios.
fr: Nous pouvons mettre à jour cette politique. Les modifications seront publiées dans l’Application ou sur notre site web. En continuant à utiliser l’Application, vous acceptez les changements.
ru: Мы можем обновлять эту политику. Изменения будут опубликованы в Приложении или на нашем сайте. Продолжение использования Приложения после обновления означает согласие с изменениями.

# privacyPolicySection8Title
source: 7. Contact Us
es: 7. Contacto
fr: 7. Contact
ru: 7. Контакты

# privacyPolicySection8Questions
source: If you have any questions or requests, please contact us:
es: Si tiene preguntas o solicitudes, puede contactarnos en:
fr: Si vous avez des questions ou des demandes, veuillez nous contacter :
ru: Если у вас есть вопросы или запросы, свяжитесь с нами:

# privacyPolicySection8Developer
source: - Developer: Dmitry Mishchenko (K4DJE)
es: - Desarrollador: Dmitry Mishchenko (K4DJE)
fr: - Développeur : Dmitry Mishchenko (K4DJE)
ru: - Разработчик: Мищенко Дмитрий (K4DJE)

# privacyPolicySection8Studio
source: - Studio: K4DJE Studio
es: - Estudio: K4DJE Studio
ru: - Студия: K4DJE Studio

# privacyPolicyThanks
source: Thank you for using Iskai! We appreciate your trust.
es: ¡Gracias por usar Iskai! Agradecemos su confianza.
fr: Merci d’utiliser Iskai ! Nous apprécions votre confiance.
ru: Спасибо за использование Iskai! Мы ценим ваше доверие.

source: Still in development
es: Aún en desarrollo
fr: Encore en développement
ru: Ещё в разработке

source: Incomplete page
es: Página incompleta
fr: Page incomplète
ru: Незавершённая страница

# skipBtn
source: Skip
es: Omitir
fr: Ignorer
ru: Пропустить

# onboardingSubtitle5
source: Transfer data over WI-FI or save it in a JSON file.
es: Transfiere datos por Wi-Fi o guárdalos en un archivo JSON
fr: Transférez vos données via Wi-Fi ou enregistrez-les dans un fichier JSON
ru: Передавайте данные по WI-FI или сохраняйте их в JSON файле

# onboardingTitle5
source: Share your dictionary without the Internet
es: Comparte tu diccionario sin Internet
fr: Partagez votre dictionnaire sans Internet
ru: Делитесь словарём без интернета

# onboardingSubtitle4
source: With the help of data statistics, you can see your growth
es: Con las estadísticas, puedes ver tu progreso
fr: Grâce aux statistiques, suivez vos progrès
ru: С помощью статистики данных вы можете видеть ваш рост

# onboardingTitle4
source: Keep track of your progress
es: Sigue tu progreso
fr: Suivez votre progression
ru: Следите за своим прогрессом

# onboardingSubtitle3
source: Flashcards and other mini games will help you memorize foreign words.
es: Tarjetas y minijuegos para memorizar palabras extranjeras
fr: Les fiches et mini-jeux vous aident à mémoriser les mots étrangers
ru: Обучающие карточки и другие мини игры помогут вам запоминать иностранные слова

# onboardingTitle3
source: Learn words by playing
es: Aprende palabras jugando
fr: Apprenez en jouant
ru: Учите слова играя

# onboardingSubtitle2
source: Group words by topic, level, or language, whichever suits you best.
es: Agrupa palabras por tema, nivel o idioma — como te resulte más cómodo
fr: Regroupez les mots par thème, niveau ou langue — comme vous le souhaitez
ru: Группируйте слова по темам, уровням или языкам - как удобно вам

# onboardingTitle2
source: Create folders and add words
es: Crea carpetas y añade palabras
fr: Créez des dossiers et ajoutez des mots
ru: Создавайте папки и добавляйте слова

# onboardingSubtitle1
source: This application specializes in improving the learning process of foreign language words.
es: Esta aplicación mejora el aprendizaje de palabras en idiomas extranjeros
fr: Cette application est conçue pour améliorer l’apprentissage des mots étrangers
ru: Это приложение специализируется в улучшении процесса изучения слов иностранных языков

# onboardingTitle1
source: Welcome to the Iskai app
es: Bienvenido a Iskai
fr: Bienvenue dans Iskai
ru: Добро пожаловать в приложение Iskai

# errorTitle
source: Error:
fr: Erreur :
ru: Ошибка:

# importError
source: An error occurred when importing data
es: Ocurrió un error al importar los datos
fr: Une erreur s’est produite lors de l’importation
ru: Произошла ошибка при импорте данных

# importCanceled
source: Data import has been canceled
es: Importación cancelada
fr: Importation annulée
ru: Импорт данных был отменён

# importSuccess
source: Data import completed
es: Importación completada
fr: Importation terminée
ru: Импорт данных завершён

# importLoad
source: Data is being imported
es: Importando datos…
fr: Importation en cours…
ru: Происходит импорт данных

# selectFileTitle
source: Select a file
es: Seleccionar archivo
fr: Sélectionner un fichier
ru: Выбрать файл

# selectFileForImport
source: Select the file with the extension .the json you want to import:
es: Selecciona un archivo .json para importar:
fr: Sélectionnez un fichier .json à importer :
ru: Выберите файл с расширением .json, который хотите импортировать:

# filePathAfterEport
source: The file was saved along the way:
es: Archivo guardado en:
fr: Fichier enregistré dans :
ru: Файл был сохранён по пути:

# exportError
source: An error occurred when exporting data
es: Error al exportar los datos
fr: Erreur lors de l’exportation
ru: Произошла ошибка при экспорте данных

# exportCanceled
source: Data export has been canceled.
es: Exportación cancelada
fr: Exportation annulée
ru: Экспорт данных был отменён

# exportSuccess
source: Data export completed
es: Exportación completada
fr: Exportation terminée
ru: Экспорт данных завершён

# exportLoad
source: The data is being exported
es: Exportando datos…
fr: Exportation en cours…
ru: Происходит экспорт данных

# exportAndImportTitle
source: When importing data, all previous data will be permanently deleted.
es: Al importar, todos los datos anteriores se eliminarán permanentemente.
fr: L’importation supprimera définitivement toutes les données existantes.
ru: При импорте данных все предыдущие данные будут безвозвратно удалены.

# importingDataTile
source: Importing data
es: Importando datos
fr: Importation des données
ru: Импорт данных

# exportingDataTile
source: Exporting data
es: Exportando datos
fr: Exportation des données
ru: Экспорт данных

# exportAndImportPage
source: Exporting and importing data
es: Exportar e importar datos
fr: Exportation et importation
ru: Экспорт и импорт данных

source: Receive data
es: Recibir datos
fr: Recevoir les données
ru: Получение данных

# selectAction
source: Select an action:
es: Selecciona una acción:
fr: Choisissez une action :
ru: Выберите действие:

# receivingBtn
source: Receiving
es: Recibir
fr: Recevoir
ru: Получение

# sendingBtn
source: Sending
es: Enviar
fr: Envoyer
ru: Отправка

# dataReceiveSuccess
source: The data was successfully received
es: Datos recibidos con éxito
fr: Données reçues avec succès
ru: Данные успешно получены

# dataReceiveLoad
source: Data is being received
es: Recibiendo datos…
fr: Réception en cours…
ru: Идёт получение данных

# cancelSend
source: Cancel
es: Cancelar
fr: Annuler
ru: Отменить

# retrySend
source: Retry
es: Reintentar
fr: Réessayer
ru: Повторить

# dataFailedSent
source: Couldn't send data
es: No se pudieron enviar los datos
fr: Échec de l’envoi
ru: Не удалось отправить данные

# exitBtn
source: Exit
es: Salir
fr: Quitter
ru: Выйти

# dataSentSuccessfully
source: The data has been sent successfully!
es: ¡Datos enviados con éxito!
fr: Données envoyées avec succès !
ru: Данные успешно отправлены!

# sendingDataToRecipent
source: Sending data to the recipient
es: Enviando datos al destinatario
fr: Envoi des données au destinataire
ru: Отправка данных получателю

source: Send data
es: Enviar datos
fr: Envoyer les données
ru: Отправить данные

# receiverIpAddress
source: Recipient's IP address
es: Dirección IP del destinatario
fr: Adresse IP du destinataire
ru: IP адрес получителя

# qrScanTitle
source: QR scanner is only available on mobile devices
es: El escáner QR solo está disponible en dispositivos móviles
fr: Le scanner QR est disponible uniquement sur mobile
ru: QR-сканер доступен только на мобильных устройствах

# scanRecipientQRCode
source: Scan the recipient's QR code
es: Escanea el código QR del destinatario
fr: Scannez le QR code du destinataire
ru: Отсканируйте QR-код получателя

# sendDataToLocalServerTitle
source: Send data to IP:
es: Enviar datos a la IP:
fr: Envoyer les données à l’IP :
ru: Отправить данные на IP:

# localServerStatus2
source: The server is enabled
es: Servidor activado
fr: Serveur activé
ru: Сервер включён

# localServerStatus1
source: The server is turned off
es: Servidor desactivado
fr: Serveur désactivé
ru: Сервер выключен

# urQRCodeTitle
source: Your QR code for transmission over IP:
es: Tu código QR para transmisión por IP
fr: Votre QR code pour transfert IP
ru: Ваш QR-код для передачи по IP

source: Stop receiving data
es: Dejar de recibir datos
fr: Arrêter la réception
ru: Прекратить получение данных

# receiveTitle
source: Click 'Receive' to generate a QR code
es: Pulsa «Recibir» para generar un código QR
fr: Cliquez sur « Recevoir » pour générer un QR code
ru: Нажмите «Получить», чтобы сгенерировать QR-код

source: Receive
es: Recibir
fr: Recevoir
ru: Получить

# minutes
source: min
ru: мин

# selectTimeForWorkout
source: Сhoose the time you want to complete the workout
es: Elige el tiempo para completar el ejercicio
fr: Choisissez la durée de l’exercice
ru: Выберите время, за которое будете проходить тренировку

# timePageTitle
source: Spelling a word based on the translation of time
es: Escribe la palabra a partir de la traducción, cronometrado
fr: Écrivez le mot à partir de sa traduction, chronométré
ru: Написание слова по переводу на время

# wordInFlashcard
source: Word:
es: Palabra:
fr: Mot :
ru: Слово:

# translateInFlashcard
source: Translate:
es: Traducción:
fr: Traduction :
ru: Перевод:

source: No more words
es: No hay más palabras
fr: Plus de mots
ru: Слов больше нету

# highDifficulty
source: High
es: Difícil
fr: Difficile
ru: Сложно

# mediumDifficulty
source: Medium
es: Medio
fr: Moyen
ru: Средне

# lowDifficulty
source: Easy
es: Fácil
fr: Facile
ru: Легко

source: Next word
es: Siguiente palabra
fr: Mot suivant
ru: Следующее слово

source: Show answer
es: Mostrar respuesta
fr: Afficher la réponse
ru: Показать ответ

# totalNumberAnswers
source: Total number of answers:
es: Total de respuestas:
fr: Total des réponses :
ru: Общее количество ответов

# numberIncorrectAnswers
source: Number of incorrect answers:
es: Respuestas incorrectas:
fr: Réponses incorrectes :
ru: Количество неправильных ответов:

# numberCorrectAnswers
source: Number of correct answers:
es: Respuestas correctas:
fr: Réponses correctes :
ru: Количество правильных ответов:

# averageNumberTitle
source: Average number of answers per day:
es: Promedio de respuestas por día:
fr: Moyenne de réponses par jour :
ru: Среднее количество ответов в день:

source: Words learned:
es: Palabras aprendidas:
fr: Mots appris :
ru: Изучено слов:

source: Search words
es: Buscar palabras
fr: Rechercher des mots
ru: Поиск слов

# noWords
source: There are no words
es: No hay palabras
fr: Aucun mot
ru: Слов нету

# noWordsDescription
source: There are no words for the flashcards. Add new words or wait for words.
es: No hay palabras para las tarjetas. Añade nuevas o espera.
fr: Aucun mot disponible pour les fiches. Ajoutez-en ou attendez.
ru: Слов для обучающих карточек нету, добавьте новые слова или дождитесь слов

# showExitDialogTitle
source: Are you sure you want to finish the workout?
es: ¿Seguro que quieres terminar el ejercicio?
fr: Voulez-vous vraiment quitter l’exercice ?
ru: Вы точно хотите завершить тренировку?

# yesAction
source: Yes
es: Sí
fr: Oui
ru: Да

# noAction
source: No
fr: Non
ru: Нет

# globalSyncDescription
source: Word folders are transferred through a server that mediates between the two devices. The server does not store any data, it only resends the database.
es: Las carpetas se transfieren mediante un servidor intermediario. No se almacenan datos; el servidor solo reenvía la base.
fr: Les dossiers sont transférés via un serveur intermédiaire. Aucune donnée n’est stockée — le serveur ne fait que relayer la base.
ru: Передача папок со словами происходит через сервер, который служит посредником между двумя устройствами. Сервер не хранит никакие данные, он только переотправляет базу данных

# localSyncDescription
source: How does local sync work? You can transfer all your folders to another device via a Wi-Fi hotspot or when both devices are connected to the same Wi-Fi network.
es: La sincronización local funciona mediante hotspot Wi-Fi o en la misma red Wi-Fi. Transfiere todas tus carpetas a otro dispositivo.
fr: La synchronisation locale fonctionne via un hotspot Wi-Fi ou sur le même réseau Wi-Fi. Transférez tous vos dossiers à un autre appareil.
ru: Как происходит локальная синхронизация? Вы можете передавать все свои папки на другое устройство через точку доступа Wi-Fi или когда оба устройства подключены к одному и тому же Wi-Fi

# renameFolder
source: Rename
es: Renombrar
fr: Renommer
ru: Переименовать

# deleteFolder
source: Delete
es: Eliminar
fr: Supprimer
ru: Удалить

# folderActionsPage
source: Folder management
es: Gestión de carpetas
fr: Gestion des dossiers
ru: Управление папками

# allFlashcards
source: All words
es: Todas las palabras
fr: Tous les mots
ru: Все слова

# timePage
source: For a while
es: Con cronómetro
fr: Chronométré
ru: На время

# noWordsFound
source: Words not found
es: No se encontraron palabras
fr: Aucun mot trouvé
ru: Слова не найдены

source: day
es: día
fr: jour
ru: день

# daysGenitive
source: days
es: días
fr: jours
ru: дня

source: days
es: días
fr: jours
ru: дней

# deleteWord
source: Delete
es: Eliminar
fr: Supprimer
ru: Удалить

source: Select language
es: Seleccionar idioma
fr: Choisir la langue
ru: Выберите язык

# bgColor
source: Background color
es: Color de fondo
fr: Couleur d’arrière-plan
ru: Цвет фона

# interfaceAppColor
source: The color of the app interface
es: Color de la interfaz
fr: Couleur de l’interface
ru: Цвет интерфейса приложения

source: Deleting a folder
es: Eliminando carpeta
fr: Suppression d’un dossier
ru: Удаление папки

# exportAndImportFoldersInExcel
source: Export and import folder
es: Exportar e importar carpeta
fr: Exporter/Importer un dossier
ru: Экспорт и импорт папки

source: Remove Ads
es: Quitar anuncios
fr: Supprimer les publicités
ru: Убрать рекламу

source: Language
es: Idioma
fr: Langue
ru: Язык

source: Share app
es: Compartir app
fr: Partager l’appli
ru: Поделиться приложением

# rateUs
source: Rate the app
es: Evaluar la aplicación
fr: Évaluer l'application
ru: Оценить приложение

source: Feedback
es: Comentarios
fr: Retour d’expérience
ru: Обратная связь

source: Privacy Policy
es: Política de privacidad
fr: Politique de confidentialité
ru: Политика конфиденциальности

# appVersion
source: Version 1.0.1
es: Versión 1.0.1
ru: Версия 1.0.1

# privacyPolicySection8Email
source: - Email: k4djexfullstack@gmail.com
es: - Correo electrónico: k4djexfullstack@gmail.com
