Repository: K4DJee/isky_flutter
Catalog: lib/l10n/app_*.arb
Languages: es, fr, ru

# languageNameEn
source: English
es: Inglés
fr: Anglais
ru: Английский

# languageNameRu
source: Russian
es: Ruso
fr: Russe
ru: Русский

# languageNameFr
source: French
es: Francés
fr: Français
ru: Французский

# languageNameEs
source: Spanish
es: Español
fr: Espagnol
ru: Испанский

# menuTitle
source: Menu
es: Menú
ru: Меню

source: Your folders
es: Tus carpetas
fr: Vos dossiers
ru: Ваши папки

# mainPage
source: Main
es: Inicio
fr: Accueil
ru: Главная

# synchronizationPage
source: Synchronization
es: Sincronización
fr: Synchronisation
ru: Синхронизация

# statisticsPage
source: Statistics
es: Estadísticas
fr: Statistiques
ru: Статистика

# educationAnki
source: Flashcards
es: Tarjetas de estudio
fr: Fiches d'apprentissage
ru: Обучающие карточки

# settingsPage
source: Settings
es: Ajustes
fr: Paramètres
ru: Настройки

# showBottomSheetChange
source: Change
es: Cambiar
fr: Modifier
ru: Изменить

# addFolderTooltip
source: Add Folder
es: Añadir carpeta
fr: Ajouter un dossier
ru: Добавить папку

# addWordTooltip
source: Add Word
es: Añadir palabra
fr: Ajouter un mot
ru: Добавить слово

# deleteConfirmation
source: Are you sure?
es: ¿Estás seguro de que quieres hacer esto?
fr: Êtes-vous sûr(e) de vouloir faire cela ?
ru: Вы точно хотите это сделать?

# closeButton
source: Close
es: Cerrar
fr: Fermer
ru: Закрыть

# addWordButton
source: Add word
es: Añadir palabra
fr: Ajouter le mot
ru: Добавить слово

# addWordModal
source: Adding a word
es: Añadir palabra
fr: Ajout d’un mot
ru: Добавление слова

# wordInput
source: Word
es: Palabra
fr: Mot
ru: Слово

# translateInput
source: Translate
es: Traducción
fr: Traduction
ru: Перевод

# exampleInput
source: Example
es: Ejemplo
fr: Exemple
ru: Пример

# createNewFolder
source: Creating new folder
es: Crear nueva carpeta
fr: Création d’un nouveau dossier
ru: Создание новой папки

source: Select folder
es: Seleccionar carpeta
fr: Sélectionner un dossier
ru: Выберите папку

# nameFolder
source: Folder name
es: Nombre de la carpeta
fr: Nom du dossier
ru: Название папки

# createFolderButton
source: Create folder
es: Crear carpeta
fr: Créer le dossier
ru: Создать папку

# folderNameHint
source: Enter the folder name
es: Introduce el nombre de la carpeta
fr: Entrez le nom du dossier
ru: Введите название папки

# wordHint
source: Enter the word
es: Introduce la palabra
fr: Entrez le mot
ru: Введите слово

# translateHint
source: Translate
es: Traducción
fr: Traduction
ru: Перевод

# exampleHint
source: Example (optional)
es: Ejemplo (opcional)
fr: Exemple (facultatif)
ru: Пример (необязательно)

# wordsInFolder
source: Words:
es: Palabras:
fr: Mots :
ru: Слов:

# selectedFolderTitle
source: Folder:
es: Carpeta:
fr: Dossier :
ru: Папка:

# folderAbsent
source: no folder
es: Sin carpeta
fr: Aucun dossier
ru: Нет папки

# wordActionsTitle
source: Editing a word
es: Editar palabra
fr: Modifier le mot
ru: Редактирование слова

# localSync
source: Local synchronization
es: Sincronización local
fr: Synchronisation locale
ru: Локальная синхронизация

# globalSync
source: Global synchronization
es: Sincronización global
fr: Synchronisation globale
ru: Глобальная синхронизация

source: Support us
es: Apóyanos
fr: Soutenez-nous
ru: Поддержите нас

# createFolder
source: Create a folder
es: Crea una carpeta
fr: Créez un dossier
ru: Создайте папку

source: Error switching to the next card:
es: Error al pasar a la siguiente tarjeta:
fr: Erreur lors du passage à la fiche suivante :
ru: Ошибка перехода к следующей карточке:

# folderModalError2
source: Please enter the folder name.
es: Por favor, introduce el nombre de la carpeta.
fr: Veuillez entrer un nom de dossier.
ru: Пожалуйста, введите название папки.

# folderModalError1
source: the folder name cannot be empty!
es: ¡El nombre de la carpeta no puede estar vacío!
fr: Le nom du dossier ne peut pas être vide !
ru: название папки не может быть пустым!

# dataSuccessfullyAccepted
source: The data was successfully accepted!
es: ¡Datos aceptados con éxito!
fr: Les données ont été acceptées avec succès !
ru: Данные успешно приняты!

# errorGettingIpStatus
source: Error receiving the IP address
es: Error al obtener la dirección IP
fr: Erreur lors de la récupération de l’adresse IP
ru: Ошибка получения IP адреса

# errorGettingIp
source: Error receiving the IP. Check your Wifi connection
es: Error al obtener la IP. Verifica la conexión Wi-Fi.
fr: Erreur de récupération de l’IP. Vérifiez votre connexion Wi-Fi.
ru: Ошибка получения IP. Проверьте Wifi соединение

# countOfTime
source: Time:
es: Tiempo:
fr: Temps :
ru: Время:

# countOfMistakes
source: Mistakes:
es: Errores:
fr: Erreurs :
ru: Ошибок:

# countOfcorrectWords
source: Correctly::
es: Correctas:
fr: Corrects :
ru: Правильно:

source: Total words:
es: Palabras totales:
fr: Mots au total :
ru: Всего слов:

# timeIsUp
source: Time's up!
es: ¡Se acabó el tiempo!
fr: Le temps est écoulé !
ru: Время закончилось!

source: Unknown error
es: Error desconocido
fr: Erreur inconnue
ru: Неизвестная ошибка

# folderNamePage
source: Changing the folder name
es: Cambiar nombre de la carpeta
fr: Modifier le nom du dossier
ru: Изменение названия папки

# errorLoadingFlashcards
source: Error loading the flashcards:
es: Error al cargar las tarjetas:
fr: Erreur lors du chargement des fiches :
ru: Ошибка загрузки обучающей карточек:

# errorLoadingFlashcard
source: Error loading the flashcard:
es: Error al cargar la tarjeta:
fr: Erreur lors du chargement de la fiche :
ru: Ошибка загрузки обучающей карточки:

# wordSetsTooltip
source: Go to Word sets
es: Ir a conjuntos de palabras
fr: Accéder aux jeux de mots
ru: Перейти в наборы слов

source: Amount of words:
es: Cantidad de palabras:
fr: Nombre de mots :
ru: Количество слов:

# downloadSelectedWordsBtn
source: Download selected files
es: Descargar archivos seleccionados
fr: Télécharger les fichiers sélectionnés
ru: Загрузить выбранные файлы

# downloadAllWordsBtn
source: Download all words
es: Descargar todo
fr: Tout télécharger
ru: Загрузить все

source: Error adding words:
es: Error al añadir palabras:
fr: Erreur lors de l’ajout des mots :
ru: Ошибка при добавлении слов:

# selectLang
source: Select a language
es: Selecciona un idioma
fr: Sélectionner une langue
ru: Выберите язык

# successAddedWordsToFolders
source: Words added to folder!
es: ¡Palabras añadidas a la carpeta!
fr: Mots ajoutés au dossier !
ru: Слова добавлены в папку!

# notSelectedWordsForAdd
source: There are no selected words
es: No hay palabras seleccionadas
fr: Aucun mot sélectionné
ru: Нет выбранных слов

# errorLoadJsonFromWordSet
source: Error loading JSON:
es: Error al cargar el JSON:
fr: Erreur lors du chargement du JSON :
ru: Ошибка загрузки JSON:

# wordSetsPage
source: Set of words
es: Conjuntos de palabras
fr: Jeux de mots
ru: Наборы слов

# numbersSetDescription
source: Numbers
es: Números
fr: Nombres
ru: Числа

# animalsSetDescription
source: Animal names
es: Nombres de animales
fr: Noms d’animaux
ru: Названия животных

# foodSetDescription
source: Food names
es: Nombres de alimentos
fr: Noms d’aliments
ru: Названия продуктов питания

# educationSetDescription
source: Words related to education and learning.
es: Palabras relacionadas con la educación y el aprendizaje.
fr: Mots liés à l’éducation et à l’apprentissage.
ru: Слова, связанные с образованием и обучением.

# numbersSetName
source: Numbers
es: Números
fr: Nombres
ru: Числа

# animalsSetName
source: Animals
es: Animales
fr: Animaux
ru: Животные

# foodSetName
source: Food
es: Comida
fr: Nourriture
ru: Еда

# educationSetName
source: Education
es: Educación
fr: Éducation
ru: Образование

# minigamesPage
source: Mini-games
es: Minijuegos
fr: Mini-jeux
ru: Мини-игры

# achievementsPage
source: Achievements
es: Logros
fr: Réalisations
ru: Достижения

# privacyPolicyTitle
source: Privacy Policy
es: Política de privacidad
fr: Politique de confidentialité
ru: Политика конфиденциальности

# privacyPolicyHeader
source: Privacy Policy of the Iskai App
es: Política de privacidad de la aplicación Iskai
fr: Politique de confidentialité de l’application Iskai
ru: Политика конфиденциальности приложения Iskai

# privacyPolicyLastUpdated
source: Last updated: November 13, 2025
es: Última actualización: 13 de noviembre de 2025
fr: Dernière mise à jour : 13 novembre 2025
ru: Дата последнего обновления: 13 ноября 2025 года

# privacyPolicyWelcome
source: Welcome to the Privacy Policy of the Iskai app ("App"). This policy explains how we collect, use, store, and protect your personal information when using the App. Iskai is developed by K4DJE Studio (developer: K4DJE, Dmitry Mishchenko) and is available on MacOS, Linux, Windows, Android, and iOS. We are committed to transparency and protecting your privacy.
es: Bienvenido(a) a la Política de Privacidad de la aplicación Iskai ("la Aplicación"). Esta política describe cómo recopilamos, utilizamos, almacenamos y protegemos su información personal al usar la Aplicación. Iskai ha sido desarrollada por K4DJE Studio (desarrollador: K4DJE, Dmitry Mishchenko) y está disponible para MacOS, Linux, Windows, Android y iOS. Nos comprometemos a mantener la transparencia y a proteger su privacidad.
fr: Bienvenue dans la politique de confidentialité de l’application Iskai (« l’Application »). Cette politique décrit comment nous collectons, utilisons, stockons et protégeons vos informations personnelles lors de l’utilisation de l’Application. Iskai est développée par K4DJE Studio (développeur : K4DJE, Dmitry Mishchenko) et est disponible sur MacOS, Linux, Windows, Android et iOS. Nous nous engageons à une transparence totale et à la protection de votre vie privée.
ru: Добро пожаловать в политику конфиденциальности приложения Iskai (далее - Приложение). Эта политика описывает, как мы собираем, используем, храним и защищаем вашу личную информацию при использовании Приложения. Приложение Iskai разработано студией K4DJE Studio (разработчик: K4DJE, Мищенко Дмитрий) и доступно на платформах MacOS, Linux, Windows, Android и iOS. Мы стремимся к максимальной прозрачности и защите вашей конфиденциальности.

# privacyPolicyAgreement
source: By using the App, you agree to the terms of this policy. If you do not agree, please do not use the App.
es: Al usar la Aplicación, usted acepta los términos de esta política. Si no está de acuerdo, por favor no utilice la Aplicación.
fr: En utilisant l’Application, vous acceptez les termes de cette politique. Si vous n’êtes pas d’accord, veuillez ne pas utiliser l’Application.
ru: Используя Приложение, вы соглашаетесь с условиями этой политики. Если вы не согласны, пожалуйста, не используйте Приложение.

# privacyPolicySection1Title
source: 1. Information We Collect
es: 1. Información que recopilamos
fr: 1. Informations que nous collectons
ru: 1. Информация, которую мы собираем

# privacyPolicySection1Description
source: Iskai is designed to create dictionaries, organize words into folders, export and import data via JSON files, and synchronize data between devices. We minimize the collection of personal data and do not store it on our servers unless necessary.
es: Iskai está diseñada para crear diccionarios, organizar palabras en carpetas, exportar e importar datos mediante archivos JSON, y sincronizar información entre dispositivos. Minimamos la recopilación de datos personales y no los almacenamos en nuestros servidores salvo que sea estrictamente necesario.
fr: Iskai est conçue pour créer des dictionnaires, organiser des mots dans des dossiers, exporter et importer des données via des fichiers JSON, et synchroniser les données entre appareils. Nous minimisons la collecte de données personnelles et ne les stockons pas sur nos serveurs sauf si cela est nécessaire.
ru: Приложение Iskai предназначено для создания словарей, организации слов в папки, экспорта и импорта данных через JSON-файлы, а также синхронизации данных между устройствами. Мы минимизируем сбор личных данных и не храним их на наших серверах без необходимости.

# privacyPolicySection1_1Title
source: 1.1. Data Provided by the User
es: 1.1. Datos proporcionados por el usuario
fr: 1.1. Données fournies par l’utilisateur
ru: 1.1. Данные, предоставляемые пользователем

# privacyPolicySection1_1DictionaryContent
source: - Dictionary content: Words, folders, and related data you enter in the App. This data is stored locally on your device.
es: - Contenido de los diccionarios: Palabras, carpetas y datos relacionados que usted introduce en la Aplicación. Estos datos se almacenan localmente en su dispositivo.
fr: - Contenu du dictionnaire : Mots, dossiers et données associées que vous saisissez dans l’Application. Ces données sont stockées localement sur votre appareil.
ru: - Содержимое словарей: Слова, папки и связанные данные, которые вы вводите в Приложение. Эти данные хранятся локально на вашем устройстве.

# privacyPolicySection1_1SyncData
source: - Synchronization data: During local sync (via Wi-Fi within the same network) or global sync (via an intermediary server), only your dictionary data is transmitted. The server does not store these data; it acts solely as a temporary bridge between devices.
es: - Datos de sincronización: Durante la sincronización local (a través de Wi-Fi en la misma red) o global (a través de un servidor intermedio), solo se transmiten sus datos de diccionario. El servidor no guarda estos datos; actúa únicamente como un intermediario temporal entre dispositivos.
fr: - Données de synchronisation : Lors d’une synchronisation locale (via Wi-Fi sur le même réseau) ou globale (via un serveur intermédiaire), seules vos données de dictionnaire sont transmises. Le serveur ne conserve pas ces données ; il agit uniquement comme un relais temporaire.
ru: - Данные для синхронизации: При локальной синхронизации (через Wi-Fi в одной сети) или глобальной синхронизации (через сервер-посредник) передаются только ваши данные словарей. Сервер не сохраняет эти данные; он выступает исключительно как временный посредник для передачи между устройствами.

# privacyPolicySection1_2Title
source: 1.2. Automatically Collected Data
es: 1.2. Datos recopilados automáticamente
fr: 1.2. Données collectées automatiquement
ru: 1.2. Автоматически собираемые данные

# privacyPolicySection1_2TechnicalInfo
source: - Technical information: IP address, device type, OS version, and unique device ID (for synchronization and debugging purposes).
es: - Información técnica: Dirección IP, tipo de dispositivo, versión del sistema operativo e identificador único del dispositivo (para sincronización y resolución de errores).
fr: - Informations techniques : Adresse IP, type d’appareil, version du système d’exploitation, identifiant unique de l’appareil (pour la synchronisation et la correction des erreurs).
ru: - Техническая информация: IP-адрес, тип устройства, версия ОС, уникальный идентификатор устройства (для синхронизации и отладки ошибок).

# privacyPolicySection1_2UsageData
source: - Usage data: Information about how you interact with the App, such as feature usage frequency, used to improve the product (anonymized).
es: - Datos de uso: Información sobre cómo interactúa con la Aplicación, como la frecuencia de uso de las funciones, utilizada para mejorar el producto (de manera anonimizada).
fr: - Données d’utilisation : Informations sur votre interaction avec l’Application, telles que la fréquence d’utilisation des fonctions, utilisées pour améliorer le produit (données anonymisées).
ru: - Данные об использовании: Информация о взаимодействии с Приложением, такая как частота использования функций, для улучшения продукта (анонимизировано).

# privacyPolicySection1_2AdData
source: - Advertising data: The App integrates ads via Yandex Ads. Yandex may collect data for ad personalization, including device identifiers, approximate location (based on IP), and in-app behavior. We do not have access to this data; it is processed by Yandex according to their Privacy Policy.
es: - Datos publicitarios: La Aplicación integra anuncios mediante Yandex Ads. Yandex puede recopilar datos para personalizar la publicidad, incluyendo identificadores de dispositivo, ubicación aproximada (basada en la IP) y comportamiento dentro de la Aplicación. No tenemos acceso a estos datos; son procesados por Yandex de acuerdo con su Política de Privacidad.
fr: - Données publicitaires : L’application intègre la publicité via Yandex Ads. Yandex peut collecter des données pour personnaliser les annonces, y compris les identifiants d’appareil, la localisation approximative (basée sur l’adresse IP) et le comportement dans l’application. Nous n’avons pas accès à ces données ; elles sont traitées par Yandex conformément à leur politique de confidentialité.
ru: - Рекламные данные: Приложение интегрирует рекламу через Yandex Ads. Yandex может собирать данные для персонализации рекламы, включая идентификаторы устройства, местоположение (примерное, на основе IP) и поведение в Приложении. Мы не имеем доступа к этим данным; они обрабатываются Yandex в соответствии с их политикой конфиденциальности.

# privacyPolicyNoSensitiveData
source: We do not collect sensitive information such as biometric data, financial details, or health information.
es: No recopilamos información sensible como datos biométricos, financieros o relacionados con la salud.
fr: Nous ne collectons pas d’informations sensibles telles que des données biométriques, financières ou de santé.
ru: Мы не собираем чувствительную информацию, такую как биометрические данные, финансовые сведения или данные о здоровье.

# privacyPolicySection2Title
source: 2. How We Use Your Information
es: 2. Cómo utilizamos su información
fr: 2. Comment nous utilisons vos informations
ru: 2. Как мы используем вашу информацию

# privacyPolicySection2Services
source: - To provide services: Storing and synchronizing your dictionary data between devices.
es: - Para proporcionar servicios: Almacenamiento y sincronización de sus datos de diccionario entre dispositivos.
fr: - Pour fournir les services : Stockage et synchronisation de vos données de dictionnaire entre appareils.
ru: - Для предоставления услуг: Хранение и синхронизация ваших данных словарей между устройствами.

# privacyPolicySection2Improvement
source: - To improve the App: Analyzing anonymized usage data to identify bugs and optimize features.
es: - Para mejorar la Aplicación: Análisis de datos anonimizados sobre el uso para detectar errores y optimizar las funciones.
fr: - Pour améliorer l’Application : Analyse de données anonymisées pour identifier les erreurs et optimiser les fonctionnalités.
ru: - Для улучшения Приложения: Анализ анонимизированных данных об использовании для выявления ошибок и оптимизации функций.

# privacyPolicySection2Ads
source: - For advertising: Yandex Ads uses collected data to display relevant ads. We are not directly involved in this process.
es: - Para publicidad: Yandex Ads utiliza los datos recopilados para mostrar anuncios relevantes. No participamos directamente en este proceso.
fr: - Pour la publicité : Yandex Ads utilise les données collectées pour afficher des annonces pertinentes. Nous ne participons pas directement à ce processus.
ru: - Для рекламы: Yandex Ads использует собранные данные для показа релевантной рекламы. Мы не участвуем в этом процессе напрямую.

# privacyPolicySection2Legal
source: - To comply with laws: When required to fulfill legal obligations, such as responding to requests from authorities.
es: - Para cumplir con la ley: En caso necesario, para atender obligaciones legales, como responder a solicitudes de autoridades gubernamentales.
fr: - Pour se conformer à la loi : Si nécessaire pour répondre à des obligations légales, comme les demandes des autorités.
ru: - Для соблюдения законов: В случае необходимости, для выполнения юридических обязательств, таких как ответ на запросы органов власти.

# privacyPolicyNoSellingData
source: We do not sell your personal data to third parties.
es: No vendemos su información personal a terceros.
fr: Nous ne vendons pas vos informations personnelles à des tiers.
ru: Мы не продаем вашу личную информацию третьим сторонам.

# privacyPolicySection3Title
source: 3. Disclosure to Third Parties
es: 3. Divulgación a terceros
fr: 3. Divulgation à des tiers
ru: 3. Раскрытие информации третьим сторонам

# privacyPolicySection3YandexAds
source: - Yandex Ads: To enable ads, we share minimal technical data (e.g., device identifiers) with Yandex. Details about Yandex’s data processing are available in their Privacy Policy: https://yandex.com/legal/confidential/.
es: - Yandex Ads: Para integrar publicidad, compartimos datos técnicos mínimos (por ejemplo, identificadores de dispositivo) con Yandex. Puede consultar los detalles sobre el tratamiento de datos en su Política de Privacidad: https://yandex.com/legal/confidential/.
fr: - Yandex Ads : Pour l’intégration de la publicité, nous partageons des données techniques minimales (par ex. identifiants d’appareil) avec Yandex. Détails disponibles dans leur politique de confidentialité : https://yandex.com/legal/confidential/.
ru: - Yandex Ads: Для интеграции рекламы мы делимся минимальными техническими данными (например, идентификаторами устройства) с Yandex. Подробности обработки данных Yandex доступны в их политике конфиденциальности: https://yandex.com/legal/confidential/.

# privacyPolicySection3SyncServers
source: - Sync servers: During global synchronization, data passes through our servers but is not stored. We may use cloud providers (e.g., AWS or similar) that comply with security standards.
es: - Servidores de sincronización: Durante la sincronización global, los datos pasan por nuestros servidores pero no se almacenan. Podemos utilizar proveedores en la nube (por ejemplo, AWS u otros similares) que cumplan con los estándares de seguridad.
fr: - Serveurs de synchronisation : Lors d’une synchronisation globale, les données transitent par nos serveurs mais ne sont pas stockées. Nous pouvons utiliser des fournisseurs cloud (par ex. AWS ou similaires) respectant les normes de sécurité.
ru: - Серверы синхронизации: При глобальной синхронизации данные передаются через наши серверы, но не сохраняются на них. Мы можем использовать облачные провайдеры (например, AWS или аналогичные) для хостинга, которые обязуются соблюдать стандарты безопасности.

# privacyPolicySection3OtherCases
source: - Other cases: We may disclose information if required by law, to protect our rights, or in case of a merger/acquisition of K4DJE Studio.
es: - Otros casos: Podemos divulgar información si así lo exige la ley, para proteger nuestros derechos o en caso de fusión o adquisición de K4DJE Studio.
fr: - Autres cas : Nous pouvons divulguer des informations si la loi l’exige, pour protéger nos droits, ou en cas de fusion/acquisition de K4DJE Studio.
ru: - Другие случаи: Мы можем раскрыть информацию, если это требуется по закону, для защиты наших прав или в случае слияния/приобретения студии K4DJE Studio.

# privacyPolicySection4Title
source: 4. Data Storage and Security
es: 4. Almacenamiento y seguridad de los datos
fr: 4. Stockage et sécurité des données
ru: 4. Хранение и безопасность данных

# privacyPolicySection4LocalStorage
source: - Local storage: Most data is stored on your device. We recommend using device encryption and passwords for protection.
es: - Almacenamiento local: La mayoría de los datos se guardan en su dispositivo. Recomendamos usar contraseñas y cifrado del dispositivo para su protección.
fr: - Stockage local : La plupart des données sont conservées sur votre appareil. Nous recommandons l’utilisation de mots de passe et du chiffrement de l’appareil.
ru: - Локальное хранение: Большинство данных хранится на вашем устройстве. Мы рекомендуем использовать пароли и шифрование устройства для защиты.
